{
    "experiences": [
        {
            "title": "Student Life Operations - Supervisor & Teaching Assistant",
            "subtitle": "Northeastern University",
            "workType": "Part-time",
            "workDescription": [
                "Supervised daily campus operations, coordinating between departments to ensure seamless delivery of student services and activities.",
                "Developed comprehensive training programs with interactive video content using Canva, Vyond, and Nearlife, accelerating onboarding for 50+ student workers.",
                "Resolved student and staff inquiries through proactive communication, fostering an inclusive campus environment.",
                "Led event coordination and monitoring initiatives that strengthened student engagement and community building across campus.",
                "Established standardized operational procedures that improved service consistency and team efficiency."
            ],
            "dateText": "Jan 2024 - Present"
        },
        {
            "title": "Co-Founder — AI & Data Club",
            "subtitle": "Northeastern University",
            "workType": "Leadership",
            "workDescription": [
                "Co-founded and led the AI & Data Club, building a community of 75+ students focused on hands-on learning in AI, data engineering, and applied systems.",
                "Organized technical workshops covering ML pipelines, cloud infrastructure, and data processing frameworks, fostering practical application of advanced concepts.",
                "Coordinated peer-led projects that enabled members to build end-to-end systems, from data ingestion to model deployment.",
                "Cultivated partnerships with industry professionals for guest talks and mentorship, bridging academic learning with real-world engineering practices.",
                "Established the club as a hub for collaborative learning, where students shipped production-quality projects and gained experience with modern tech stacks."
            ],
            "dateText": "Aug 2024 - Dec 2025"
        },
        {
            "title": "Software Engineer Intern",
            "subtitle": "Ipser Labs",
            "workType": "Full-time",
            "workDescription": [
                "Engineered backend Python microservices in a distributed architecture, resolving retry logic and latency issues that improved system stability by 35%.",
                "Built asynchronous ETL pipelines using AWS SQS and Lambda to process high-volume API data, transforming and loading results into PostgreSQL and DynamoDB with 99.9% reliability.",
                "Conducted parallel analytics on load-testing telemetry to identify performance bottlenecks, optimizing latency by 40% and increasing throughput across critical services.",
                "Deployed and scaled cloud-native services on AWS (EC2, ECS, S3, DynamoDB) with CloudWatch monitoring, ensuring consistent performance under variable load.",
                "Collaborated with Java engineering teams to architect inter-service communication patterns that reduced downstream failures by 25%."
            ],
            "dateText": "Feb 2025 - Jul 2025"
        },
        {
            "title": "Software Developer",
            "subtitle": "Cybrowse Digital Solutions",
            "workType": "Full-time",
            "workDescription": [
                "Architected enterprise Single Page Applications using Angular and React, delivering analytics dashboards and workflow automation tools that accelerated stakeholder decision-making.",
                "Designed and implemented RESTful APIs with Java Spring Boot using layered architecture and comprehensive exception handling, reducing redundant frontend calls by 30%.",
                "Built robust error boundaries and asynchronous state management for API integration, eliminating production UI crashes and improving application fault tolerance.",
                "Drove incident resolution through systematic analysis of application metrics, logs, and distributed traces, cutting mean time to detection by 40%.",
                "Participated in Agile development cycles with cross-functional teams, ensuring timely delivery of scalable, well-tested features through collaborative code reviews."
            ],
            "dateText": "Apr 2022 – Apr 2023"
        }
    ]
}